Revit 2027 API
MEPAnalyticalSystem.GetAirSystemData Method
 Returns the air system data, null if not available.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AirSystemData GetAirSystemData()
Public Function GetAirSystemData As AirSystemData
public:
AirSystemData^ GetAirSystemData()
member GetAirSystemData : unit -> AirSystemData
Return Value
AirSystemData
See Also
Reference
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace